[
    {
        "Text": "This generation is not okay.\n\nWe are the most connected generation in history - yet we feel lonelier than ever.\n\nWe have:\n\nFriends in every corner of the world but no one to call when we break down at 2 AM.\n\nThousands of likes on selfies but no one who genuinely likes us for who we are.\n\nA ‘perfect’ life online but an empty, exhausted soul in reality.\n\nLook around:\n\nPeople are dating just to avoid being alone. Love is no longer about connection - it’s about convenience.\n\nLooks matter more than loyalty. A six-pack gets more respect than a kind heart.\n\nLuxury is being bought on EMI. We’d rather impress strangers than build real financial stability.\n\nSuccess is about looking successful. People rent expensive cars for Instagram but can’t afford their rent.\n\nFriendships are based on utility. \"What can you do for me?\" matters more than genuine care.\n\nBreakups are text messages. Ghosting is normal. Cheating is just a \"mistake.\"\n\nMarriage is seen as a burden. People want weddings, not lifelong commitments.\n\nJobs drain us. We work long hours, burn out, and call it \"hustle.\"\n\nCheating is normal. People call it a \"mistake\" while someone’s life falls apart.\n\nFake people win. The ones who manipulate, step over others, and lie get ahead.\n\nMental health is a trend. Everyone posts about it, but no one listens when someone truly struggles.\n\nSuccess is about flexing, not achieving. Rent a luxury car, post a reel, fool the world.\n\nKindness is a performance. Show empathy online, be rude in real life.\n\nRelationships are temporary. Love today, cheat tomorrow, move on the next day.\n\nLoyalty is outdated. Who needs commitment when you have options?\n\nIf you're kind, pure, and loyal, this world will use you, break you, and leave you behind.\n\nIf you're too nice, people will take advantage of you.\n\nIf you're too honest, people will call you naïve.\n\nIf you're too loyal, people will treat you like an option.\n\nIf you're too genuine, people will think you're weak.\n\nWe chase things we don’t even want - just because the world tells us to.\n\nWe seek validation from people who wouldn’t even show up to our funeral.\n\nWe’re so scared of being left out that we forget what actually matters.\n\nMaybe the problem isn’t society. Maybe it’s us.\nMaybe we need to stop chasing, stop flexing, stop pretending.\n\nMaybe the real flex is peace.\n\nMaybe real success is having people who love you.\n\nMaybe true happiness is living for yourself, not for likes.\n\nP.s - The writer in me was dying to come out today and write!! So, sorry for the long post :)\n\nand thank you everyone for supporting me, unknowingly you all make me smile :)))",
        "engagement": 751,
        "line_count": 57,
        "language": "English",
        "tags": [
            "Mental Health",
            "Society"
        ]
    },
    {
        "Text": "If you're constantly seeing motivational posts like \"I wake up at 4 AM, meditate for an hour, run a marathon, and close five deals before breakfast,\" I just want to remind you… it’s okay to sleep in till 10 AM and stare at the ceiling questioning life.\n\nWe all sometimes feel like we’re falling behind - people are getting dream jobs, buying houses, launching startups, and here we are… *celebrating the fact that we finally did our laundry.*\n\nBut you know what? *That’s okay.*\n\nLife is not a productivity contest. Some people sprint, some people jog, and some (like me) take snack breaks every five minutes. The goal is to *not burn out before reaching the finish line.*\n\nSo if you need a break, take it. If you want to rest, do it guilt-free. *Your worth is not measured by how many ‘grindset’ reels you watch.*\n\nAnd remember, even your phone needs to recharge. So why shouldn’t you?\n\nP.s - If you read till here, I am just curious about why you follow me, like what exactly do you like about my posts? I have been doing some analysis, and I hope to bring something more on the table that you'll like :))\n\nYou guys have met Luna already, now meet Shadow (I adopted Shadow from my college and she lives in my hometown with my family, honestly she's my first child :). Also, Luna and Shadow are good friends 🌞)",
        "engagement": 76,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Productivity",
            "Motivation"
        ]
    },
    {
        "Text": "Cracked 5+ interviews last month - here’s exactly how I did it.\n\nJob hunting isn’t easy. It’s frustrating, unpredictable, and often feels unfair. But having a structured approach helped me stay sane and maximize my chances.\n\nHere’s what worked:\n\n1. Resume = First Impression Matters-\n\nTailored my resume for different roles (not rewriting, just tweaking keywords).\n\nMade sure the first two lines of each job experience showed impact, not just tasks.\n\n2. Applied Smart, Not Just Fast-\n\nPrioritized companies that matched my skill set instead of mass applying.\n\nUsed LinkedIn, Wellfound, and Naukri for targeted searches.\n\nCold messaged hiring managers when possible (not just “Hi,” but value-driven messages).\n\n3. Interviewing: Storytelling & Clarity Over Buzzwords-\n\nFor behavioral rounds: Used STAR format (Situation, Task, Action, Result) but kept it conversational.\n\nFor technical rounds: Thought out loud, asked clarifying questions, and didn’t rush to the answer.\n\nP.S - I even solved a differential/integration question in one of the interviews, so be ready for everything :)\n\n4. Post-Interview: The Follow-Up That Works-\n\nSent thoughtful follow-up emails that reiterated my strengths & interest.\n\nIf rejected, always ask for feedback and refine your approach.\n\nHope this helps :)",
        "engagement": 154,
        "line_count": 36,
        "language": "English",
        "tags": [
            "Job Search",
            "Interview Preparation"
        ]
    },
    {
        "Text": "I am so tired of hearing the fake motivational stories.\n\nI read and then find the link to book a 1:1 session in every 2nd post.\n\nIt's all business, it's all that it has been.\n\nLinkedIn's content quality has degraded because of these paid promotions.\n\nIf you're promoting something, be honest and write it straight away!\n\nAt least be honest and don't lie about the struggles just to promote something that you'll not use for yourself!",
        "engagement": 159,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Professional Networking",
            "Motivation"
        ]
    },
    {
        "Text": "Why should a corporate majdoor go to the gym?\n\nChannelise your anger, lift heavy and next time when a jerk comes and taunts you for your work, you'll feel the power - I deadlifted 145 today, I can deadlift 2 of him.\n\nYou'll not have to worry about your mental health anymore. Start running and you'll be confused - which is worse? my mental health or my physical health?\n\nYou'll stop overthinking. Because instead of lying awake at night questioning your life choices, you'll be passed out by 10 PM thinking — Was that my last set or did I black out?\n\nAnd forget office politics — once you hit leg day properly, the only thing you'll be thinking is, \"How do I climb these 3 stairs without crying?\"\n\nThe next time someone dumps extra work on you at 6 PM, you won't get angry - you'll smile and think, \"I'll use this frustration to hit a new PR tomorrow.\"\n\nCardio will teach you life’s biggest lesson - no matter how fast you run, you can’t escape your problems… or your boss's 7 AM meeting invite.",
        "engagement": 230,
        "line_count": 8,
        "language": "Hinglish",
        "tags": [
            "Wellness",
            "Corporate Life"
        ]
    },
    {
        "Text": "Unpopular opinion:\n\nAI is making people dumber and lonelier.\n\nFor the simplest tasks, people have started using AI. \nEven some are using it to share personal conversations (instead of talking to a friend).\n\nAI was meant to make life easier, not replace human connection.\n\n- Struggling with writing an email? People now ask AI.\n- Can't decide what to wear? People ask AI.\n- Feeling sad or lonely? Some vent to AI instead of calling a friend.\n\nWhile AI can be helpful, relying on it for every decision is dangerous. We're outsourcing our thinking, creativity, and even emotions to algorithms.\n\nThe result? People are becoming less independent, less connected, and more isolated.\n\nAI is a tool - use it wisely. Because no chatbot can replace the warmth of a real conversation or the comfort of someone who genuinely cares.\n\nWhat are your thoughts? Is AI making us smarter or just more dependent?",
        "engagement": 65,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Artificial Intelligence",
            "Technology"
        ]
    },
    {
        "Text": "Imagine spending weeks perfecting your resume. Hours crafting the perfect cover letter. Days preparing for an interview that never comes — because the job itself was never real.\n\nThis is ghost hiring.\n\nWhat is Ghost Hiring?\n\nGhost hiring is when companies post job openings that they have no intention of filling. Sometimes it's to:\n\n1. Collect Resumes — Building a talent pool for future needs.\n\n2. Show Growth — To appear as if the company is expanding.\n\n3. Keep Employees on Edge — Making internal teams believe they can be replaced.\n\n4. Satisfy Policies — Companies might post jobs just to meet the internal hiring process requirements, even if they’ve already chosen a candidate.\n\nBut what does this mean for job seekers? It’s heartbreaking.\n\nYou refresh your inbox every day, hoping for an update. You convince yourself you didn’t get a reply because maybe they’re busy - or maybe you need to improve your skills.\n\nIn reality, you never stood a chance because the role wasn’t real in the first place.\n\nThe Emotional Impact:\nGhost hiring doesn’t just waste time - it crushes self-esteem. Candidates start questioning their worth. They feel like they aren’t ‘good enough,’ when in reality, they were never even considered.\n\nIt leads to:\n- Imposter Syndrome — “Maybe I’m just not skilled enough.”\n\n- Burnout — Applying to hundreds of roles without meaningful responses.\n\n- Anxiety & Depression — Feeling powerless in your career.\n\nTo those facing this:\n\nIt’s *not your fault*. The silence you’re experiencing isn’t a reflection of your skills or talent. Sometimes, the system itself is broken.\n\nWhat can job seekers do?\n\n1. Ask Directly: During interviews, ask, “Is this role budget-approved and actively being hired for?” Genuine recruiters will answer honestly.\n\n2. Watch for Red Flags: If a role is repeatedly reposted but no one you know has been hired, that’s a warning sign.\n\n3. Focus on Networking: Referrals often bypass the “ghost” stage because you’re connected to someone inside.\n\nAnd to companies practicing ghost hiring:\nPlease understand - these are real people. Behind every resume is a person battling self-doubt, holding on to hope, and trying to build a future.\n\nIf you're posting jobs you don’t plan to fill, remember this: Your ‘strategy’ is someone else’s heartbreak.\n\nTo everyone who is still applying despite the silence - you are strong, resilient, and capable.\n\nOne day, the right opportunity will come - and when it does, it will be *real*.",
        "engagement": 78,
        "line_count": 56,
        "language": "English",
        "tags": [
            "Job Search",
            "Scams"
        ]
    },
    {
        "Text": "Dear HRs,\nIf candidates had the power to rate YOU after interviews, imagine how wild those reviews would be:\n\n⭐️⭐️⭐️⭐️⭐️ ‘Great communication. Gave clear timelines. Highly recommend.’\n\n⭐️⭐️ ‘Ghosted me after 4 rounds. Still waiting for closure.’\n\n⭐️ ‘Said the salary was ‘competitive.’ Turns out, they meant competitively low.’\n\n⭐️ ‘Chaache ke bhatije ko hire kar liye 5 rounds lene ke baad mere.’\n\nIt’s about time candidates get a ‘Rate My Recruiter’ platform. I'd love to see who survives that leaderboard. 😎",
        "engagement": 368,
        "line_count": 7,
        "language": "Hinglish",
        "tags": [
            "Recruiter Reviews",
            "Interview Preparation"
        ]
    },
    {
        "Text": "Degrees vs. Certifications vs. Experience: Which One Actually Matters?\n\nA degree used to be the golden ticket. Now? Not so much.\n\nHere’s the reality:\n\nDegree: Helps you get past HR filters.\n\nCertifications: Shows you’re learning, but doesn’t guarantee skills.\n\nExperience: Actually proves you can do the job.\n\nIf companies really want \"skills over degrees,\" why do job descriptions still say 'IIT/NIT preferred'?",
        "engagement": 51,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Education",
            "Career Experience"
        ]
    },
    {
        "Text": "If you are an anime fan, you know what the \"evil arc\" means.\n\nI am a big fan of that word \"evil arc\"\n\nYour Evil Arc is Just the Beginning.\n\nSometimes, life pushes you into a corner. \nYou get betrayed. Overlooked. Underestimated. \n\nPeople take you for granted. They mock your dreams. \nYou help them, but when you need support - silence. \n\nAnd then, something inside you changes. \n\nYou stop explaining. Stop seeking validation. \n\nThe old version of you? Gone. \n\nNow, you work in silence. You build in the dark. \nYou become sharper. Stronger. Ruthless with your time and energy. \n\nThis is your *evil arc* - but not in the way they think. \n\nYou're not becoming heartless. \n\nYou're just done playing small. \n\nAnd when you rise, they’ll call it luck. \nBut you’ll know - this was the moment you chose yourself. \n\nLet them doubt. Let them gossip. \nYou have an empire to build. \n\nP.s - puri post padh lena gaali dene se pehle, phir matt bolna Ranveer ko support kar rahi hai.",
        "engagement": 179,
        "line_count": 24,
        "language": "Hinglish",
        "tags": [
            "Hobbies",
            "Motivation"
        ]
    },
    {
        "Text": "To the woman reading this:\n\nYou don’t need to be perfect.\nYou don’t have to \"do it all.\"\nYou are enough - just as you are.\n\nYou are more than your productivity. More than your achievements. More than the expectations placed upon you.\n\nNot every woman is \"breaking barriers.\"\n\nSome are just trying to survive.\n\nThe woman hiding her tears at work because \"strong women don’t cry.\"\n\nThe mother battling guilt, whether she chooses career or family.\n\nThe woman exhausted from proving she’s enough - at home, at work, everywhere.\n\nThis Women’s Day, let’s celebrate all women. Not just the CEOs, the record-breakers, the fighters -\n\nBut also the quiet warriors. The ones battling self-doubt. The ones carrying invisible burdens.\n\nBecause womanhood isn’t about being \"unstoppable\" -\n\nIt’s about being human.\n\nThis Women’s Day, I hope you find peace. I hope you find love.\n\nAnd that should be enough.\nBut most of all - I hope you find yourself.\n\nBecause you deserve it.",
        "engagement": 57,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Diversity And Inclusion",
            "Motivation"
        ]
    },
    {
        "Text": "Gen Z doesnt want to work? Or do companies just not want to pay?\n\nBoomers: “Back in my day, we worked 14 hours for ₹2,000 a month!”\n\nGen Z: “Okay, that’s tragic. Not a flex.”\n\nSomewhere along the way, we confused hustle with exploitation.\n\nHere’s a wild idea:\n\nMaybe freshers deserve to be paid.\n\nMaybe passion doesn’t mean working weekends for free.\n\nMaybe “work-life balance” shouldn’t be something you earn after burning out.\n\nIf you want experience, offer mentorship. If you want free work, hire interns - and PAY them.\n\nBecause Gen Z isn’t “lazy.” They just know that exposure doesn’t pay rent.",
        "engagement": 716,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Generation Z",
            "Work Life Balance"
        ]
    }
]